{
  "backend/main.mo": "Main actor implementing video upload system with chunked uploads, metadata management, and persistence tracking. Includes MixinStorage for blob handling and migration support for adding isPersistent field to video metadata.",
  "backend/migration.mo": "Migration module that transforms old video data structures to new ones by adding isPersistent field (defaulting to false) to both VideoMetadata and Video types.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features for handling finalization failures, timeout detection (30s), and conditional rendering logic in the MasterVideoUploader and Home components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components including upload/player components with chunked upload, retry logic, exponential backoff, persistence verification, and comprehensive error handling.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining dark mode optimized color variables for the forensic age estimation website theme.",
  "frontend/index.html": "HTML entry point for the Video Loop Site application that mounts the React app to the root div.",
  "frontend/src/App.tsx": "Root React component setting up QueryClient, dark theme provider, and rendering the Home page with toast notifications.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, year, and attribution link to caffeine.ai with UTM tracking based on hostname.",
  "frontend/src/components/Header.tsx": "Header component with Skeletal Clock branding and navigation menu for Home, Visual Guide, Forensic Report, and Data Tables sections.",
  "frontend/src/components/MasterPresentationPlayer.tsx": "Video player with automatic polling/exponential backoff retry logic (up to 5 attempts), connection error detection, and user-friendly error messages for loading the master presentation video.",
  "frontend/src/components/MasterVideoUploader.tsx": "Component for uploading a master video file with chunked upload support, progress tracking, file validation (MP4, 500MB limit), and finalization handling with timeout and error management.",
  "frontend/src/components/MetricsDashboard.tsx": "Displays two charts using Recharts: a bar chart showing ossification timelines by gender and a line chart showing Suchey-Brooks phase probabilities for age estimation.",
  "frontend/src/components/VideoList.tsx": "Empty file with no content.",
  "frontend/src/components/VideoPlayer.tsx": "Empty file with no content.",
  "frontend/src/components/VideoUploader.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching video metadata and master video content, plus a mutation hook for uploading master videos with chunked upload, retry logic, and progress tracking.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like backgrounds, borders, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/Home.tsx": "Main home page component that displays a skeletal development presentation with 7 navigable scenes, integrates a master video player/uploader, and includes a metrics dashboard. Handles video upload completion callbacks with persistence verification and error handling.",
  "frontend/src/pages/VideoGallery.tsx": "Empty file with no content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography settings with Inter font, container queries, animations for accordions, and various UI component styling tokens.",
  "project_state.json": "Project metadata tracking the recreation of a Skeletal Clock forensic age estimation website with 7 scenes, video integration features, and a known issue where backend video finalization fails to persist metadata after chunked uploads complete."
}