{
  "backend/main.mo": "Main actor implementing video upload with chunked storage, metadata management, and migration support. Provides endpoints for initializing videos, uploading chunks, finalizing uploads, and retrieving video content with persistence tracking.",
  "backend/migration.mo": "Migration module that transforms old actor state (storing chunk IDs) to new format (storing VideoChunk records with content). Provides placeholder content for migrated chunks that lack blob data.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components, hooks, and pages describing video upload/playback functionality, UI components, styling, and state management patterns.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for backgrounds, foregrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Video Loop Site application.",
  "frontend/src/App.tsx": "Root React component setting up QueryClient, dark theme provider, and rendering the Home page with toast notifications.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, attribution link to caffeine.ai with UTM tracking based on hostname, and heart icon.",
  "frontend/src/components/Header.tsx": "Header component with Skeletal Clock branding, Activity icon, and navigation menu for Home, Visual Guide, Forensic Report, and Data Tables.",
  "frontend/src/components/MasterPresentationPlayer.tsx": "Video player component with automatic polling/retry logic using exponential backoff (up to 5 attempts), enhanced error handling for connection resets, and loading states with retry attempt tracking.",
  "frontend/src/components/MasterVideoUploader.tsx": "Master video upload component with file validation (MP4, 500MB limit), chunked upload progress tracking, 30-second finalization timeout detection, retry functionality, and comprehensive error handling with external persistence error support.",
  "frontend/src/components/MetricsDashboard.tsx": "Displays two charts using Recharts: a bar chart showing ossification timelines by sex for different bones, and a line chart showing Suchey-Brooks phase age probabilities for forensic age estimation.",
  "frontend/src/components/VideoList.tsx": "Empty file with no content.",
  "frontend/src/components/VideoPlayer.tsx": "Empty file with no content.",
  "frontend/src/components/VideoUploader.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the ICP backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options for idle handling and derivation origins.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching video metadata and blobs from the backend, including chunked upload logic with retry mechanisms and a specialized hook for retrieving the master video (ID 0) with its blob URL.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, charts, and semantic tokens (primary, secondary, destructive, etc.).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/Home.tsx": "Main landing page component that displays a scene-based navigation system for forensic age estimation content (prenatal through elderly), integrates master video player/uploader, and includes the metrics dashboard with upload persistence verification.",
  "frontend/src/pages/VideoGallery.tsx": "Empty file with no content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system with CSS variables, container settings, border radius variables, custom fonts (Inter), accordion animations, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file documenting a forensic age estimation website recreation with video integration features, known backend video upload finalization bugs, architectural notes about dark theme with numbered navigation, and multiple scene-based content sections in an interactive chronology."
}