{
  "backend/main.mo": "Main backend actor for video management with storage mixin, containing commented-out video upload/chunk/finalization functions and active video metadata/chunk/video maps with ID generation.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: hiding MasterVideoUploader component, hiding MasterPresentationPlayer component, and replacing Master Presentation section with static forensic-themed image in Home.tsx.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing components, pages, hooks, and configuration for a video gallery application with forensic anthropology theme and master video functionality commented out.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables including background, foreground, card, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Video Loop Site application.",
  "frontend/src/App.tsx": "Root React component setting up QueryClient, dark theme provider, Home page rendering, and toast notifications.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, year, and attribution link to caffeine.ai with UTM parameters based on hostname.",
  "frontend/src/components/Header.tsx": "Header component with Skeletal Clock branding, Activity icon, and navigation menu for Home, Visual Guide, Forensic Report, and Data Tables.",
  "frontend/src/components/MasterPresentationPlayer.tsx": "Video player component with exponential backoff polling (up to 5 retries), connection error handling, and loading/error states for master presentation video playback.",
  "frontend/src/components/MasterVideoUploader.tsx": "React component for uploading master videos with chunked upload support, progress tracking, file validation (MP4, 500MB limit), and finalization handling with timeout and error management.",
  "frontend/src/components/MetricsDashboard.tsx": "Displays two charts using Recharts: a bar chart showing ossification timelines by gender and a line chart showing Suchey-Brooks phase probabilities for age estimation.",
  "frontend/src/components/VideoList.tsx": "Empty file with no content.",
  "frontend/src/components/VideoPlayer.tsx": "Empty file with no content.",
  "frontend/src/components/VideoUploader.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages backend actor creation with Internet Identity authentication, automatically invalidating and refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for video operations including metadata fetching and chunked video uploads with retry logic; master video functionality is currently stubbed out but preserved for future use.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components using oklch color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/Home.tsx": "Main home page component that displays a forensic age estimation website with scene navigation (1-7), metrics dashboard, and commented-out video upload/playback functionality. Includes scene content for prenatal development, childhood growth, and other skeletal age markers.",
  "frontend/src/pages/VideoGallery.tsx": "Empty file with no content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography settings, animations, and theme extensions including dark mode support and custom keyframes for accordion components.",
  "project_state.json": "Project metadata tracking the recreation of a Skeletal Clock forensic age estimation website with dark theme, numbered navigation, and hidden video functionality replaced by static forensic anthropology themed imagery."
}